mkj/imxrt-pacs/svd/MIMXRT1052.svd
        <register>
          <name>GPR5</name>
          <description>GPR5 General Purpose Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WDOG1_MASK</name>
              <description>WDOG1 Timeout Mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDOG1_MASK_0</name>
                  <description>WDOG1 Timeout behaves normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG1_MASK_1</name>
                  <description>WDOG1 Timeout is masked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDOG2_MASK</name>
              <description>WDOG2 Timeout Mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDOG2_MASK_0</name>
                  <description>WDOG2 Timeout behaves normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG2_MASK_1</name>
                  <description>WDOG2 Timeout is masked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPT2_CAPIN1_SEL</name>
              <description>GPT2 input capture channel 1 source select</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT2_CAPIN1_SEL_0</name>
                  <description>source from pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2_CAPIN1_SEL_1</name>
                  <description>source from enet1.ipp_do_mac0_timer[3]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENET_EVENT3IN_SEL</name>
              <description>ENET input timer event3 source select</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENET_EVENT3IN_SEL_0</name>
                  <description>event3 source input from pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENET_EVENT3IN_SEL_1</name>
                  <description>event3 source input from gpt2.ipp_do_cmpout1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREF_1M_CLK_GPT1</name>
              <description>GPT1 1 MHz clock source select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREF_1M_CLK_GPT1_0</name>
                  <description>GPT1 ipg_clk_highfreq driven by IPG_PERCLK. IPG_PERCLK is derived from either BUS clock or OSC_24M clock. See CCM chapter for more information</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREF_1M_CLK_GPT1_1</name>
                  <description>GPT1 ipg_clk_highfreq driven by anatop 1 MHz clock. Anatop 1M clock is derived from the OSC_RC_24M clock. It has two versions: corrected by 32k clock or un-corrected. See the XTALOSC24M_OSC_CONFIG2 register for more details</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREF_1M_CLK_GPT2</name>
              <description>GPT2 1 MHz clock source select</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREF_1M_CLK_GPT2_0</name>
                  <description>GPT2 ipg_clk_highfreq driven by IPG_PERCLK. IPG_PERCLK is derived from either BUS clock or OSC_24M clock. See CCM chapter for more information</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREF_1M_CLK_GPT2_1</name>
                  <description>GPT2 ipg_clk_highfreq driven by anatop 1 MHz clock. Anatop 1M clock is derived from the OSC_RC_24M clock. It has two versions: corrected by 32k clock or un-corrected. See the XTALOSC24M_OSC_CONFIG2 register for more details</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR6</name>
          <description>GPR6 General Purpose Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QTIMER1_TRM0_INPUT_SEL</name>
              <description>QTIMER1 TMR0 input select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER1_TRM0_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER1_TRM0_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER1_TRM1_INPUT_SEL</name>
              <description>QTIMER1 TMR1 input select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER1_TRM1_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER1_TRM1_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER1_TRM2_INPUT_SEL</name>
              <description>QTIMER1 TMR2 input select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER1_TRM2_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER1_TRM2_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER1_TRM3_INPUT_SEL</name>
              <description>QTIMER1 TMR3 input select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER1_TRM3_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER1_TRM3_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER2_TRM0_INPUT_SEL</name>
              <description>QTIMER2 TMR0 input select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER2_TRM0_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER2_TRM0_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER2_TRM1_INPUT_SEL</name>
              <description>QTIMER2 TMR1 input select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER2_TRM1_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER2_TRM1_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER2_TRM2_INPUT_SEL</name>
              <description>QTIMER2 TMR2 input select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER2_TRM2_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER2_TRM2_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER2_TRM3_INPUT_SEL</name>
              <description>QTIMER2 TMR3 input select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER2_TRM3_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER2_TRM3_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER3_TRM0_INPUT_SEL</name>
              <description>QTIMER3 TMR0 input select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER3_TRM0_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER3_TRM0_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER3_TRM1_INPUT_SEL</name>
              <description>QTIMER3 TMR1 input select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER3_TRM1_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER3_TRM1_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER3_TRM2_INPUT_SEL</name>
              <description>QTIMER3 TMR2 input select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER3_TRM2_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER3_TRM2_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER3_TRM3_INPUT_SEL</name>
              <description>QTIMER3 TMR3 input select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER3_TRM3_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER3_TRM3_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER4_TRM0_INPUT_SEL</name>
              <description>QTIMER4 TMR0 input select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER4_TRM0_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER4_TRM0_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER4_TRM1_INPUT_SEL</name>
              <description>QTIMER4 TMR1 input select</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER4_TRM1_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER4_TRM1_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER4_TRM2_INPUT_SEL</name>
              <description>QTIMER4 TMR2 input select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER4_TRM2_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER4_TRM2_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER4_TRM3_INPUT_SEL</name>
              <description>QTIMER4 TMR3 input select</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER4_TRM3_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER4_TRM3_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_4</name>
              <description>IOMUXC XBAR1_INOUT4 function direction select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_4_0</name>
                  <description>XBAR1_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_4_1</name>
                  <description>XBAR1_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_5</name>
              <description>IOMUXC XBAR1_INOUT5 function direction select</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_5_0</name>
                  <description>XBAR1_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_5_1</name>
                  <description>XBAR1_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_6</name>
              <description>IOMUXC XBAR1_INOUT6 function direction select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_6_0</name>
                  <description>XBAR1_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_6_1</name>
                  <description>XBAR1_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_7</name>
              <description>IOMUXC XBAR1_INOUT7 function direction select</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_7_0</name>
                  <description>XBAR1_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_7_1</name>
                  <description>XBAR1_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_8</name>
              <description>IOMUXC XBAR1_INOUT8 function direction select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_8_0</name>
                  <description>XBAR1_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_8_1</name>
                  <description>XBAR1_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_9</name>
              <description>IOMUXC XBAR1_INOUT9 function direction select</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_9_0</name>
                  <description>XBAR1_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_9_1</name>
