mkj/imxrt-pacs/svd/MIMXRT1052.svd
        <register>
          <name>DEBUG_MODE2</name>
          <description>Debug Mode Register 2</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XPUL_PULL_DOWN</name>
              <description>XPUL Wire Pull Down Switch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XPUL_PULL_DOWN_0</name>
                  <description>Close the switch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XPUL_PULL_DOWN_1</name>
                  <description>Open up the switch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XPUL_PULL_UP</name>
              <description>XPUL Wire Pull Up Switch</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XPUL_PULL_UP_0</name>
                  <description>Close the switch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XPUL_PULL_UP_1</name>
                  <description>Open up the switch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XPUL_200K_PULL_UP</name>
              <description>XPUL Wire 200K Pull Up Switch</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XPUL_200K_PULL_UP_0</name>
                  <description>Close the switch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XPUL_200K_PULL_UP_1</name>
                  <description>Open up the switch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XNUR_PULL_DOWN</name>
              <description>XNUR Wire Pull Down Switch</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XNUR_PULL_DOWN_0</name>
                  <description>Close the switch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XNUR_PULL_DOWN_1</name>
                  <description>Open up the switch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XNUR_PULL_UP</name>
              <description>XNUR Wire Pull Up Switch</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XNUR_PULL_UP_0</name>
                  <description>Close the switch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XNUR_PULL_UP_1</name>
                  <description>Open up the switch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XNUR_200K_PULL_UP</name>
              <description>XNUR Wire 200K Pull Up Switch</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XNUR_200K_PULL_UP_0</name>
                  <description>Close the switch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XNUR_200K_PULL_UP_1</name>
                  <description>Open up the switch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>YPLL_PULL_DOWN</name>
              <description>YPLL Wire Pull Down Switch</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>YPLL_PULL_DOWN_0</name>
                  <description>Close the switch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YPLL_PULL_DOWN_1</name>
                  <description>Open up the switch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>YPLL_PULL_UP</name>
              <description>YPLL Wire Pull Up Switch</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>YPLL_PULL_UP_0</name>
                  <description>Close the switch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YPLL_PULL_UP_1</name>
                  <description>Open the switch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>YPLL_200K_PULL_UP</name>
              <description>YPLL Wire 200K Pull Up Switch</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>YPLL_200K_PULL_UP_0</name>
                  <description>Close the switch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YPLL_200K_PULL_UP_1</name>
                  <description>Open up the switch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>YNLR_PULL_DOWN</name>
              <description>YNLR Wire Pull Down Switch</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>YNLR_PULL_DOWN_0</name>
                  <description>Close the switch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YNLR_PULL_DOWN_1</name>
                  <description>Open up the switch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>YNLR_PULL_UP</name>
              <description>YNLR Wire Pull Up Switch</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>YNLR_PULL_UP_0</name>
                  <description>Close the switch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YNLR_PULL_UP_1</name>
                  <description>Open up the switch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>YNLR_200K_PULL_UP</name>
              <description>YNLR Wire 200K Pull Up Switch</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>YNLR_200K_PULL_UP_0</name>
                  <description>Close the switch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YNLR_200K_PULL_UP_1</name>
                  <description>Open up the switch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WIPER_PULL_DOWN</name>
              <description>Wiper Wire Pull Down Switch</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIPER_PULL_DOWN_0</name>
                  <description>Close the switch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIPER_PULL_DOWN_1</name>
                  <description>Open up the switch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WIPER_PULL_UP</name>
              <description>Wiper Wire Pull Up Switch</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIPER_PULL_UP_0</name>
                  <description>Close the switch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIPER_PULL_UP_1</name>
                  <description>Open up the switch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WIPER_200K_PULL_UP</name>
              <description>Wiper Wire 200K Pull Up Switch</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIPER_200K_PULL_UP_0</name>
                  <description>Close the switch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIPER_200K_PULL_UP_1</name>
                  <description>Open up the switch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DETECT_FOUR_WIRE</name>
              <description>Detect Four Wire</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DETECT_FOUR_WIRE_0</name>
                  <description>No detect signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DETECT_FOUR_WIRE_1</name>
                  <description>Yes, there is a detect on the touch screen.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DETECT_FIVE_WIRE</name>
              <description>Detect Five Wire</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DETECT_FIVE_WIRE_0</name>
                  <description>No detect signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DETECT_FIVE_WIRE_1</name>
                  <description>Yes, there is a detect on the touch screen.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATE_MACHINE</name>
              <description>State Machine</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATE_MACHINE_0</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_MACHINE_1</name>
                  <description>Pre-charge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_MACHINE_2</name>
                  <description>Detect</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_MACHINE_3</name>
                  <description>X-measure</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_MACHINE_4</name>
                  <description>Y-measure</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_MACHINE_5</name>
                  <description>Pre-charge</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_MACHINE_6</name>
                  <description>Detect</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTERMEDIATE</name>
              <description>Intermediate State</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERMEDIATE_0</name>
                  <description>Not in intermedia</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERMEDIATE_1</name>
                  <description>Intermedia</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DETECT_ENABLE_FOUR_WIRE</name>
              <description>Detect Enable Four Wire</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DETECT_ENABLE_FOUR_WIRE_0</name>
                  <description>Do not read four wire detect value, read default value from analogue</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DETECT_ENABLE_FOUR_WIRE_1</name>
                  <description>Read four wire detect status from analogue</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DETECT_ENABLE_FIVE_WIRE</name>
              <description>Detect Enable Five Wire</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DETECT_ENABLE_FIVE_WIRE_0</name>
                  <description>Do not read five wire detect value, read default value from analogue</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DETECT_ENABLE_FIVE_WIRE_1</name>
                  <description>Read five wire detect status from analogue</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DE_GLITCH</name>
              <description>This field indicates glitch threshold</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DE_GLITCH_0</name>
                  <description>Normal function: 0x1fff ipg clock cycles; Low power mode: 0x9 low power clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DE_GLITCH_1</name>
                  <description>Normal function: 0xfff ipg clock cycles; Low power mode: :0x7 low power clock cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DE_GLITCH_2</name>
                  <description>Normal function: 0x7ff ipg clock cycles; Low power mode:0x5 low power clock cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DE_GLITCH_3</name>
                  <description>Normal function: 0x3 ipg clock cycles; Low power mode:0x3 low power clock cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
