mkj/imxrt-pacs/svd/MIMXRT1052.svd
        <register>
          <name>CBCMR</name>
          <description>CCM Bus Clock Multiplexer Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2DAE8324</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPSPI_CLK_SEL</name>
              <description>Selector for lpspi clock multiplexer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI_CLK_SEL_0</name>
                  <description>derive clock from PLL3 PFD1 clk</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_CLK_SEL_1</name>
                  <description>derive clock from PLL3 PFD0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_CLK_SEL_2</name>
                  <description>derive clock from PLL2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_CLK_SEL_3</name>
                  <description>derive clock from PLL2 PFD2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERIPH_CLK2_SEL</name>
              <description>Selector for peripheral clk2 clock multiplexer</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIPH_CLK2_SEL_0</name>
                  <description>derive clock from pll3_sw_clk</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_CLK2_SEL_1</name>
                  <description>derive clock from osc_clk (pll1_ref_clk)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_CLK2_SEL_2</name>
                  <description>derive clock from pll2_bypass_clk</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRACE_CLK_SEL</name>
              <description>Selector for Trace clock multiplexer</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRACE_CLK_SEL_0</name>
                  <description>derive clock from PLL2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACE_CLK_SEL_1</name>
                  <description>derive clock from PLL2 PFD2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACE_CLK_SEL_2</name>
                  <description>derive clock from PLL2 PFD0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACE_CLK_SEL_3</name>
                  <description>derive clock from PLL2 PFD1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRE_PERIPH_CLK_SEL</name>
              <description>Selector for pre_periph clock multiplexer</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRE_PERIPH_CLK_SEL_0</name>
                  <description>derive clock from PLL2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRE_PERIPH_CLK_SEL_1</name>
                  <description>derive clock from PLL2 PFD2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRE_PERIPH_CLK_SEL_2</name>
                  <description>derive clock from PLL2 PFD0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRE_PERIPH_CLK_SEL_3</name>
                  <description>derive clock from divided PLL1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDIF_PODF</name>
              <description>Post-divider for LCDIF clock.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCDIF_PODF_0</name>
                  <description>divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDIF_PODF_1</name>
                  <description>divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDIF_PODF_2</name>
                  <description>divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDIF_PODF_3</name>
                  <description>divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDIF_PODF_4</name>
                  <description>divide by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDIF_PODF_5</name>
                  <description>divide by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDIF_PODF_6</name>
                  <description>divide by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDIF_PODF_7</name>
                  <description>divide by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI_PODF</name>
              <description>Divider for LPSPI. Divider should be updated when output clock is gated.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI_PODF_0</name>
                  <description>divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_1</name>
                  <description>divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_2</name>
                  <description>divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_3</name>
                  <description>divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_4</name>
                  <description>divide by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_5</name>
                  <description>divide by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_6</name>
                  <description>divide by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_7</name>
                  <description>divide by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
