mkj/imxrt-pacs/svd/MIMXRT1052.svd
        <register>
          <name>OUT_CTRL_TOG</name>
          <description>Output Buffer Control Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FORMAT</name>
              <description>Output framebuffer format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARGB8888</name>
                  <description>32-bit pixels</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB888</name>
                  <description>32-bit pixels (unpacked 24-bit pixel in 32 bit DWORD.)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB888P</name>
                  <description>24-bit pixels (packed 24-bit format)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB1555</name>
                  <description>16-bit pixels</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB4444</name>
                  <description>16-bit pixels</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB555</name>
                  <description>16-bit pixels</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB444</name>
                  <description>16-bit pixels</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB565</name>
                  <description>16-bit pixels</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV1P444</name>
                  <description>32-bit pixels (1-plane XYUV unpacked)</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UYVY1P422</name>
                  <description>16-bit pixels (1-plane U0,Y0,V0,Y1 interleaved bytes)</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VYUY1P422</name>
                  <description>16-bit pixels (1-plane V0,Y0,U0,Y1 interleaved bytes)</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Y8</name>
                  <description>8-bit monochrome pixels (1-plane Y luma output)</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Y4</name>
                  <description>4-bit monochrome pixels (1-plane Y luma, 4 bit truncation)</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV2P422</name>
                  <description>16-bit pixels (2-plane UV interleaved bytes)</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV2P420</name>
                  <description>16-bit pixels (2-plane UV)</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YVU2P422</name>
                  <description>16-bit pixels (2-plane VU interleaved bytes)</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YVU2P420</name>
                  <description>16-bit pixels (2-plane VU)</description>
                  <value>0x1B</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTERLACED_OUTPUT</name>
              <description>Determines how the PXP writes it's output data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROGRESSIVE</name>
                  <description>All data written in progressive format to the OUTBUF Pointer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIELD0</name>
                  <description>Interlaced output: only data for field 0 is written to the OUTBUF Pointer.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIELD1</name>
                  <description>Interlaced output: only data for field 1 is written to the OUTBUF2 Pointer.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERLACED</name>
                  <description>Interlaced output: data for field 0 is written to OUTBUF and data for field 1 is written to OUTBUF2.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALPHA_OUTPUT</name>
              <description>Indicates that alpha component in output buffer pixels should be overwritten by PXP_OUT_CTRL[ALPHA]</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Retain</name>
                  <description>Retain</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Overwritten</name>
                  <description>Overwritten</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALPHA</name>
              <description>When generating an output buffer with an alpha component, the value in this field will be used when enabled to override the alpha passed through the pixel data pipeline</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_BUF</name>
          <description>Output Frame Buffer Pointer</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Current address pointer for the output frame buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_BUF2</name>
          <description>Output Frame Buffer Pointer #2</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Current address pointer for the output frame buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_PITCH</name>
          <description>Output Buffer Pitch</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PITCH</name>
              <description>Indicates the number of bytes in memory between two vertically adjacent pixels.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_LRC</name>
          <description>Output Surface Lower Right Coordinate</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Y</name>
              <description>Indicates the number of vertical PIXELS in the output surface (non-rotated)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X</name>
              <description>Indicates number of horizontal PIXELS in the output surface (non-rotated)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_PS_ULC</name>
          <description>Processed Surface Upper Left Coordinate</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Y</name>
              <description>This field indicates the upper left Y-coordinate (in pixels) of the processed surface in the output buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X</name>
              <description>This field indicates the upper left X-coordinate (in pixels) of the processed surface (PS) in the output buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_PS_LRC</name>
          <description>Processed Surface Lower Right Coordinate</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Y</name>
              <description>This field indicates the lower right Y-coordinate (in pixels) of the processed surface in the output frame buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X</name>
              <description>This field indicates the lower right X-coordinate (in pixels) of the processed surface (PS) in the output frame buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_AS_ULC</name>
          <description>Alpha Surface Upper Left Coordinate</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Y</name>
              <description>This field indicates the upper left Y-coordinate (in pixels) of the alpha surface in the output frame buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X</name>
              <description>This field indicates the upper left X-coordinate (in pixels) of the alpha surface (AS) in the output frame buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_AS_LRC</name>
          <description>Alpha Surface Lower Right Coordinate</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Y</name>
              <description>This field indicates the lower right Y-coordinate (in pixels) of the alpha surface in the output frame buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X</name>
              <description>This field indicates the lower right X-coordinate (in pixels) of the alpha surface (AS) in the output frame buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PS_CTRL</name>
          <description>Processed Surface (PS) Control Register</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FORMAT</name>
              <description>PS buffer format. To select between YUV and YCbCr formats, see bit 31 of the CSC1_COEF0 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RGB888_ARGB8888</name>
                  <description>32-bit pixels (unpacked 24-bit format with/without alpha at high 8bits)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB555_ARGB1555</name>
                  <description>16-bit pixels with/without alpha at high 1bit</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB444_ARGB4444</name>
                  <description>16-bit pixels with/without alpha at high 4 bits</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB565</name>
                  <description>16-bit pixels</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV1P444</name>
                  <description>32-bit pixels (1-plane XYUV unpacked)</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UYVY1P422</name>
                  <description>16-bit pixels (1-plane U0,Y0,V0,Y1 interleaved bytes)</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VYUY1P422</name>
                  <description>16-bit pixels (1-plane V0,Y0,U0,Y1 interleaved bytes)</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Y8</name>
                  <description>8-bit monochrome pixels (1-plane Y luma output)</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Y4</name>
                  <description>4-bit monochrome pixels (1-plane Y luma, 4 bit truncation)</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV2P422</name>
                  <description>16-bit pixels (2-plane UV interleaved bytes)</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV2P420</name>
                  <description>16-bit pixels (2-plane UV)</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YVU2P422</name>
                  <description>16-bit pixels (2-plane VU interleaved bytes)</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YVU2P420</name>
                  <description>16-bit pixels (2-plane VU)</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV422</name>
                  <description>16-bit pixels (3-plane format)</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV420</name>
                  <description>16-bit pixels (3-plane format)</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA8888</name>
                  <description>2-bit pixels with alpha at the low 8 bits</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA5551</name>
                  <description>16-bit pixels with alpha at the low 1bits</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA4444</name>
                  <description>16-bit pixels with alpha at the low 4 bits</description>
                  <value>0x2D</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WB_SWAP</name>
              <description>Swap bytes in words. For each 16 bit word, the two bytes will be swapped.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Byte swap is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Byte swap is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECY</name>
              <description>Verticle pre decimation filter control.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable pre-decimation filter.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECY2</name>
                  <description>Decimate PS by 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECY4</name>
                  <description>Decimate PS by 4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECY8</name>
                  <description>Decimate PS by 8.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECX</name>
              <description>Horizontal pre decimation filter control.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable pre-decimation filter.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECX2</name>
                  <description>Decimate PS by 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECX4</name>
                  <description>Decimate PS by 4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECX8</name>
                  <description>Decimate PS by 8.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
