mkj/imxrt-pacs/svd/MIMXRT1052.svd
        <register>
          <name>PS_CTRL_SET</name>
          <description>Processed Surface (PS) Control Register</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FORMAT</name>
              <description>PS buffer format. To select between YUV and YCbCr formats, see bit 31 of the CSC1_COEF0 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RGB888_ARGB8888</name>
                  <description>32-bit pixels (unpacked 24-bit format with/without alpha at high 8bits)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB555_ARGB1555</name>
                  <description>16-bit pixels with/without alpha at high 1bit</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB444_ARGB4444</name>
                  <description>16-bit pixels with/without alpha at high 4 bits</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB565</name>
                  <description>16-bit pixels</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV1P444</name>
                  <description>32-bit pixels (1-plane XYUV unpacked)</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UYVY1P422</name>
                  <description>16-bit pixels (1-plane U0,Y0,V0,Y1 interleaved bytes)</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VYUY1P422</name>
                  <description>16-bit pixels (1-plane V0,Y0,U0,Y1 interleaved bytes)</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Y8</name>
                  <description>8-bit monochrome pixels (1-plane Y luma output)</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Y4</name>
                  <description>4-bit monochrome pixels (1-plane Y luma, 4 bit truncation)</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV2P422</name>
                  <description>16-bit pixels (2-plane UV interleaved bytes)</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV2P420</name>
                  <description>16-bit pixels (2-plane UV)</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YVU2P422</name>
                  <description>16-bit pixels (2-plane VU interleaved bytes)</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YVU2P420</name>
                  <description>16-bit pixels (2-plane VU)</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV422</name>
                  <description>16-bit pixels (3-plane format)</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV420</name>
                  <description>16-bit pixels (3-plane format)</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA8888</name>
                  <description>2-bit pixels with alpha at the low 8 bits</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA5551</name>
                  <description>16-bit pixels with alpha at the low 1bits</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA4444</name>
                  <description>16-bit pixels with alpha at the low 4 bits</description>
                  <value>0x2D</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WB_SWAP</name>
              <description>Swap bytes in words. For each 16 bit word, the two bytes will be swapped.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Byte swap is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Byte swap is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECY</name>
              <description>Verticle pre decimation filter control.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable pre-decimation filter.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECY2</name>
                  <description>Decimate PS by 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECY4</name>
                  <description>Decimate PS by 4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECY8</name>
                  <description>Decimate PS by 8.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECX</name>
              <description>Horizontal pre decimation filter control.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable pre-decimation filter.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECX2</name>
                  <description>Decimate PS by 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECX4</name>
                  <description>Decimate PS by 4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECX8</name>
                  <description>Decimate PS by 8.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PS_CTRL_CLR</name>
          <description>Processed Surface (PS) Control Register</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FORMAT</name>
              <description>PS buffer format. To select between YUV and YCbCr formats, see bit 31 of the CSC1_COEF0 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RGB888_ARGB8888</name>
                  <description>32-bit pixels (unpacked 24-bit format with/without alpha at high 8bits)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB555_ARGB1555</name>
                  <description>16-bit pixels with/without alpha at high 1bit</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB444_ARGB4444</name>
                  <description>16-bit pixels with/without alpha at high 4 bits</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB565</name>
                  <description>16-bit pixels</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV1P444</name>
                  <description>32-bit pixels (1-plane XYUV unpacked)</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UYVY1P422</name>
                  <description>16-bit pixels (1-plane U0,Y0,V0,Y1 interleaved bytes)</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VYUY1P422</name>
                  <description>16-bit pixels (1-plane V0,Y0,U0,Y1 interleaved bytes)</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Y8</name>
                  <description>8-bit monochrome pixels (1-plane Y luma output)</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Y4</name>
                  <description>4-bit monochrome pixels (1-plane Y luma, 4 bit truncation)</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV2P422</name>
                  <description>16-bit pixels (2-plane UV interleaved bytes)</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV2P420</name>
                  <description>16-bit pixels (2-plane UV)</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YVU2P422</name>
                  <description>16-bit pixels (2-plane VU interleaved bytes)</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YVU2P420</name>
                  <description>16-bit pixels (2-plane VU)</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV422</name>
                  <description>16-bit pixels (3-plane format)</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV420</name>
                  <description>16-bit pixels (3-plane format)</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA8888</name>
                  <description>2-bit pixels with alpha at the low 8 bits</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA5551</name>
                  <description>16-bit pixels with alpha at the low 1bits</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA4444</name>
                  <description>16-bit pixels with alpha at the low 4 bits</description>
                  <value>0x2D</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WB_SWAP</name>
              <description>Swap bytes in words. For each 16 bit word, the two bytes will be swapped.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Byte swap is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Byte swap is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECY</name>
              <description>Verticle pre decimation filter control.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable pre-decimation filter.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECY2</name>
                  <description>Decimate PS by 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECY4</name>
                  <description>Decimate PS by 4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECY8</name>
                  <description>Decimate PS by 8.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECX</name>
              <description>Horizontal pre decimation filter control.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable pre-decimation filter.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECX2</name>
                  <description>Decimate PS by 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECX4</name>
                  <description>Decimate PS by 4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECX8</name>
                  <description>Decimate PS by 8.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
