mkj/imxrt-pacs/svd/MIMXRT1052.svd
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWAP16_EN_0</name>
                  <description>Disable swapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWAP16_EN_1</name>
                  <description>Enable swapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>CSI Control Register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSC</name>
              <description>Horizontal Skip Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSC</name>
              <description>Vertical Skip Count. Contains the number of rows to skip. SCE must be 1, otherwise VSC is ignored.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVRM</name>
              <description>Live View Resolution Mode. Selects the grid size used for live view resolution.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVRM_0</name>
                  <description>512 x 384</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVRM_1</name>
                  <description>448 x 336</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVRM_2</name>
                  <description>384 x 288</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVRM_3</name>
                  <description>384 x 256</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVRM_4</name>
                  <description>320 x 240</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVRM_5</name>
                  <description>288 x 216</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVRM_6</name>
                  <description>400 x 300</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BTS</name>
              <description>Bayer Tile Start. Controls the Bayer pattern starting point.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BTS_0</name>
                  <description>GR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTS_1</name>
                  <description>RG</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTS_2</name>
                  <description>BG</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTS_3</name>
                  <description>GB</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCE</name>
              <description>Skip Count Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCE_0</name>
                  <description>Skip count disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_1</name>
                  <description>Skip count enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFS</name>
              <description>Auto Focus Spread. Selects which green pixels are used for auto-focus.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AFS_0</name>
                  <description>Abs Diff on consecutive green pixels</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFS_1</name>
                  <description>Abs Diff on every third green pixels</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFS_2</name>
                  <description>Abs Diff on every four green pixels</description>
                  <value>#1x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRM</name>
              <description>Double Resolution Mode. Controls size of statistics grid.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DRM_0</name>
                  <description>Stats grid of 8 x 6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DRM_1</name>
                  <description>Stats grid of 8 x 12</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_BURST_TYPE_SFF</name>
              <description>Burst Type of DMA Transfer from STATFIFO. Selects the burst type of DMA transfer from STATFIFO.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_BURST_TYPE_SFF_0</name>
                  <description>INCR8</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_BURST_TYPE_SFF_1</name>
                  <description>INCR4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_BURST_TYPE_SFF_3</name>
                  <description>INCR16</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_BURST_TYPE_RFF</name>
              <description>Burst Type of DMA Transfer from RxFIFO. Selects the burst type of DMA transfer from RxFIFO.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_BURST_TYPE_RFF_0</name>
                  <description>INCR8</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_BURST_TYPE_RFF_1</name>
                  <description>INCR4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_BURST_TYPE_RFF_3</name>
                  <description>INCR16</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <description>CSI Control Register 3</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ECC_AUTO_EN</name>
              <description>Automatic Error Correction Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECC_AUTO_EN_0</name>
                  <description>Auto Error correction is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECC_AUTO_EN_1</name>
                  <description>Auto Error correction is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECC_INT_EN</name>
              <description>Error Detection Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECC_INT_EN_0</name>
                  <description>No interrupt is generated when error is detected. Only the status bit ECC_INT is set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECC_INT_EN_1</name>
                  <description>Interrupt is generated when error is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZERO_PACK_EN</name>
              <description>Dummy Zero Packing Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO_PACK_EN_0</name>
                  <description>Zero packing disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO_PACK_EN_1</name>
                  <description>Zero packing enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SENSOR_16BITS</name>
              <description>16-bit Sensor Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENSOR_16BITS_0</name>
                  <description>Only one 8-bit sensor is connected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENSOR_16BITS_1</name>
                  <description>One 16-bit sensor is connected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RxFF_LEVEL</name>
              <description>RxFIFO Full Level</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RxFF_LEVEL_0</name>
                  <description>4 Double words</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFF_LEVEL_1</name>
                  <description>8 Double words</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFF_LEVEL_2</name>
                  <description>16 Double words</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFF_LEVEL_3</name>
                  <description>24 Double words</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFF_LEVEL_4</name>
                  <description>32 Double words</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFF_LEVEL_5</name>
                  <description>48 Double words</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFF_LEVEL_6</name>
                  <description>64 Double words</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFF_LEVEL_7</name>
                  <description>96 Double words</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRESP_ERR_EN</name>
              <description>Hresponse Error Enable. This bit enables the hresponse (AHB protocol standard) error interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRESP_ERR_EN_0</name>
                  <description>Disable hresponse error interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRESP_ERR_EN_1</name>
                  <description>Enable hresponse error interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATFF_LEVEL</name>
              <description>STATFIFO Full Level</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATFF_LEVEL_0</name>
                  <description>4 Double words</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFF_LEVEL_1</name>
                  <description>8 Double words</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFF_LEVEL_2</name>
                  <description>12 Double words</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFF_LEVEL_3</name>
                  <description>16 Double words</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFF_LEVEL_4</name>
                  <description>24 Double words</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFF_LEVEL_5</name>
                  <description>32 Double words</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFF_LEVEL_6</name>
                  <description>48 Double words</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFF_LEVEL_7</name>
                  <description>64 Double words</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_REQ_EN_SFF</name>
              <description>DMA Request Enable for STATFIFO</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_REQ_EN_SFF_0</name>
                  <description>Disable the dma request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ_EN_SFF_1</name>
                  <description>Enable the dma request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_REQ_EN_RFF</name>
              <description>DMA Request Enable for RxFIFO</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_REQ_EN_RFF_0</name>
                  <description>Disable the dma request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ_EN_RFF_1</name>
                  <description>Enable the dma request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_REFLASH_SFF</name>
              <description>Reflash DMA Controller for STATFIFO</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_REFLASH_SFF_0</name>
                  <description>No reflashing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REFLASH_SFF_1</name>
                  <description>Reflash the embedded DMA controller</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_REFLASH_RFF</name>
              <description>Reflash DMA Controller for RxFIFO</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_REFLASH_RFF_0</name>
                  <description>No reflashing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REFLASH_RFF_1</name>
                  <description>Reflash the embedded DMA controller</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRMCNT_RST</name>
              <description>Frame Count Reset. Resets the Frame Counter. (Cleared automatically after reset is done)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRMCNT_RST_0</name>
                  <description>Do not reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRMCNT_RST_1</name>
                  <description>Reset frame counter immediately</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRMCNT</name>
              <description>Frame Counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATFIFO</name>
          <description>CSI Statistic FIFO Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STAT</name>
              <description>Static data from sensor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFIFO</name>
          <description>CSI RX FIFO Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IMAGE</name>
              <description>Received image data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
