mkj/imxrt-pacs/svd/MIMXRT1052.svd
        <register>
          <name>DMA_CTRL</name>
          <description>ETC DMA control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIG0_ENABLE</name>
              <description>Enable DMA request when TRIG0 done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG0_ENABLE_0</name>
                  <description>TRIG0 DMA request disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG0_ENABLE_1</name>
                  <description>TRIG0 DMA request enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG1_ENABLE</name>
              <description>Enable DMA request when TRIG1 done.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG1_ENABLE_0</name>
                  <description>TRIG1 DMA request disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG1_ENABLE_1</name>
                  <description>TRIG1 DMA request enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG2_ENABLE</name>
              <description>Enable DMA request when TRIG2 done.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG2_ENABLE_0</name>
                  <description>TRIG2 DMA request disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG2_ENABLE_1</name>
                  <description>TRIG2 DMA request enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG3_ENABLE</name>
              <description>Enable DMA request when TRIG3 done.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG3_ENABLE_0</name>
                  <description>TRIG3 DMA request disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG3_ENABLE_1</name>
                  <description>TRIG3 DMA request enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG4_ENABLE</name>
              <description>Enable DMA request when TRIG4 done.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG4_ENABLE_0</name>
                  <description>TRIG4 DMA request disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG4_ENABLE_1</name>
                  <description>TRIG4 DMA request enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG5_ENABLE</name>
              <description>Enable DMA request when TRIG5 done.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG5_ENABLE_0</name>
                  <description>TRIG5 DMA request disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG5_ENABLE_1</name>
                  <description>TRIG5 DMA request enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG6_ENABLE</name>
              <description>Enable DMA request when TRIG6 done.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG6_ENABLE_0</name>
                  <description>TRIG6 DMA request disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG6_ENABLE_1</name>
                  <description>TRIG6 DMA request enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG7_ENABLE</name>
              <description>Enable DMA request when TRIG7 done.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG7_ENABLE_0</name>
                  <description>TRIG7 DMA request disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG7_ENABLE_1</name>
                  <description>TRIG7 DMA request enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG0_REQ</name>
              <description>Flag bit for DMA request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG0_REQ_0</name>
                  <description>TRIG0_REQ not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG0_REQ_1</name>
                  <description>TRIG0_REQ detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG1_REQ</name>
              <description>Flag bit for DMA request</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG1_REQ_0</name>
                  <description>TRIG1_REQ not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG1_REQ_1</name>
                  <description>TRIG1_REQ detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG2_REQ</name>
              <description>Flag bit for DMA request</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG2_REQ_0</name>
                  <description>TRIG2_REQ not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG2_REQ_1</name>
                  <description>TRIG2_REQ detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG3_REQ</name>
              <description>Flag bit for DMA request</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG3_REQ_0</name>
                  <description>TRIG3_REQ not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG3_REQ_1</name>
                  <description>TRIG3_REQ detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG4_REQ</name>
              <description>Flag bit for DMA request</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG4_REQ_0</name>
                  <description>TRIG4_REQ not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG4_REQ_1</name>
                  <description>TRIG4_REQ detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG5_REQ</name>
              <description>Flag bit for DMA request</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG5_REQ_0</name>
                  <description>TRIG5_REQ not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG5_REQ_1</name>
                  <description>TRIG5_REQ detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG6_REQ</name>
              <description>Flag bit for DMA request</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG6_REQ_0</name>
                  <description>TRIG6_REQ not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG6_REQ_1</name>
                  <description>TRIG6_REQ detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG7_REQ</name>
              <description>Flag bit for DMA request</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG7_REQ_0</name>
                  <description>TRIG7_REQ not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG7_REQ_1</name>
                  <description>TRIG7_REQ detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG0_CTRL</name>
          <description>ETC_TRIG Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_TRIG</name>
              <description>Software trigger. This field is self-clearing.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_TRIG_0</name>
                  <description>No software trigger event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_TRIG_1</name>
                  <description>Software trigger event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG_MODE</name>
              <description>Trigger mode selection.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_MODE_0</name>
                  <description>Hardware trigger. The softerware trigger will be ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_MODE_1</name>
                  <description>Software trigger. The hardware trigger will be ignored.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG_CHAIN</name>
              <description>The number of segments inside the trigger chain of TRIGa.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_CHAIN_0</name>
                  <description>Trigger chain length is 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CHAIN_1</name>
                  <description>Trigger chain length is 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CHAIN_2</name>
                  <description>Trigger chain length is 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CHAIN_3</name>
                  <description>Trigger chain length is 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CHAIN_4</name>
                  <description>Trigger chain length is 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CHAIN_5</name>
                  <description>Trigger chain length is 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CHAIN_6</name>
                  <description>Trigger chain length is 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CHAIN_7</name>
                  <description>Trigger chain length is 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG_PRIORITY</name>
              <description>External trigger priority, 7 is highest priority, while 0 is lowest</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_MODE</name>
              <description>Trigger synchronization mode selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNC_MODE_0</name>
                  <description>Synchronization mode disabled, TRIGa and TRIG(a+4) are triggered independently.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC_MODE_1</name>
                  <description>Synchronization mode enabled, TRIGa and TRIG(a+4) are triggered by TRIGa source synchronously.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG0_COUNTER</name>
          <description>ETC_TRIG Counter Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INIT_DELAY</name>
              <description>TRIGGER initial delay counter. Initial_delay = (INIT_DELAY+1)*(PRE_DIVIDER+1)*ipg_clk</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE_INTERVAL</name>
              <description>TRIGGER sampling interval counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
